app/views/api/friends/index.json.jbuilder


  current_user.friends.each do |user|
---
SELECT "friends".* FROM "friends"