app/controllers/api/friends_controller.rb

SELECT "friends".* FROM "friends"
---
  def index
    friends1 = current_user.friendships
    friends2 = []

    friends1.each do |friend|

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "friends" ("user_id", "friend_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 2], ["friend_id", 1]]
---
  def create
    @friend = Friend.new(friend_params)
    @user = User.find_by_id(@friend.friend_id)

    if @friend.save

SELECT  "friends".* FROM "friends" WHERE "friends"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
    @friend = Friend.find(params[:id])
    @user = User.find_by_id(@friend.friend_id)