app/controllers/api/search_controller.rb

  def users
    @users = User.search(params[:query])
---
SELECT "users".* FROM "users" WHERE (user_name LIKE '%')