app/controllers/api/users_controller.rb

INSERT INTO "users" ("user_name", "email", "phone", "img_url", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE (user_name LIKE '%')
---
  def search
    @users = User.search(params[:query])